% Μέρος 3___Εφαρμογή Α
% % Part 1 Δημιουργήστε το σήμα
Fs=2000;          % συχνότητα δειγματοληψίας 2000 Hz
Ts=1/Fs;          % περίοδος δειγματοληψίας
L=2000;           % μήκος σήματος (αριθμός δειγμάτων)
T=L*Ts;           % διάρκεια σήματος
t=0:Ts:(L-1)*Ts;  % χρονικές στιγμές υπολογισμού το σήματος
x=sin(2*pi*100*t)... % ημιτονικό σήμα συχνότητας 100 Hz
+ 0.3*sin(2*pi*150*(t-2))... % συνιστώσα 150 Hz
+ sin(2*pi*200*t); % συνιστώσα 200 Hz

% Σχεδιάστε το σήμα στο πεδίο του χρόνου
figure(1)                      % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,x)                      % γραφική παράσταση του σήματος
title('Time domain plot of x') % τίτλος γραφικής παράστασης
xlabel('t (sec)')              % λεζάντα στον άξονα x
ylabel('Amplitude')            % λεζάντα στον άξονα y
pause                          % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
axis([0 0.3 -2 2])             % εμφάνιση του σήματος από 0 έως 0.3 sec και
                               % κλίμακα από -2 έως 2
pause                          % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

% Υπολογίστε τον διακριτό μετασχηματισμό Fourier
N = 2^nextpow2(L);   % μήκος μετασχηματισμού Fourier.
                     % H nextpow2 βρίσκει τον εκθέτη της δύναμης του 2 που
                     % είναι μεγαλύτερη ή ίση από το όρισμα L
                     % εναλλακτικά, =ceil(log2(L))
Fo=Fs/N;             % ανάλυση συχνότητας
f=(0:N-1)*Fo;        % διάνυσμα συχνοτήτων
X= fft(x,N);         % αριθμητικός υπολογισμός του διακριτού μετασχηματισμού
                     % Fourier (DFT) για Ν σημεία

% Σχεδιάστε το σήμα στο πεδίο συχνότητας
% Αφού το σήμα είναι πραγματικό μπορείτε
% να σχεδιάσετε μόνο τις θετικές συχνότητες
figure(2)                           % άνοιγμα παραθύρου για γραφική παράσταση
plot(f(1:N/2),abs(X(1:N/2)))        % γραφική παράσταση των θετικών συχνοτήτων
title('Frequency domain plot of x') % τίτλος γραφικής παράστασης
xlabel('f (Hz)')                    % λεζάντα στον άξονα x
ylabel('Amplitude')                 % λεζάντα στον άξονα y
pause                               % αναμονή για να δείτε το σχήμα
% πιέστε ένα πλήκτρο για να συνεχίσετε

% για τη γραφική παράσταση του αμφίπλευρου φάσματος
% πρέπει να χρησιμοποιήσετε την fftshift ώστε ο όρος για
% τη συχνότητα μηδέν να μετακινηθεί στην αρχή των αξόνων
figure(3)                   % άνοιγμα παραθύρου για γραφική παράσταση
f=f-Fs/2;                   % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
X=fftshift(X);              % ολίσθηση της μηδενικής συχνότητας στο κέντρο 
                            % του φάσματος
                            % (ακολουθούν πολλές εντολές σε μια γραμμή) 
plot(f,abs(X));title('Two sided spectrum of x'); xlabel('f (Hz)');
ylabel('Amplitude') 
pause                       % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

% Υπολογίστε την ισχύ
power_noise=X.*conj(X)/N/L;      % υπολογισμός πυκνότητας ισχύος
figure(4)                  % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power_noise)              % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)')   % λεζάντα στον άξονα x
ylabel('Power')            % λεζάντα στον άξονα y
title('{\bf Periodogram}') % τίτλος διαγράμματος με παχιά γράμματα
pause

disp('Part2')
% Part 2 Προσθέστε θόρυβο στο σήμα
% Συμπληρώστε τον κώδικα για τη δημιουργία του σήματος θορύβου n με τη
% βοήθεια της συνάρτησης randn.
% Το διάνυσμα θορύβου n θα πρέπει να είναι του ίδιου μεγέθους με αυτό της
% ημιτονοειδούς κυματομορφής x του πρώτου μέρους. Δείτε help size.
% Σχεδιάστε το σήμα θορύβου στο διάστημα από 0 έως 0.3 sec και κλίμακα
% από -2 έως 2
% Υπολογίστε το περιοδόγραμμα του n και σχεδιάστε την πυκνότητα φάσματος
% ισχύος του σήματος θορύβου.
% Προσθέστε το σήμα θορύβου και το x για να λάβετε το σήμα με θόρυβο s.
% Σχεδιάσατε το σήμα με θόρυβο s στο πεδίο του χρόνου στην περιοχή 0 έως
% 0.2 sec και κλίμακα από -2 έως 2 καθώς και το αμφίπλευρο φάσμα του

% Θόρυβος 
n=randn(size(x));             % Το διάνυσμα θορύβου n θα πρέπει να είναι του ίδιου μεγέθους με αυτό της
                              % ημιτονοειδούς κυματομορφής x του πρώτου μέρους
figure(5) 
plot(t,n)                      % γραφική παράσταση του σήματος θορύβου
title('Time domain plot of n')
xlabel('t(sec)')
ylabel('Amplitude')
axis([0 0.3 -2 2])             % εμφάνιση του σήματος από 0 έως 0.3 sec και
                               % κλίμακα από -2 έως 2
pause    

% περιοδόγραμμα του n
figure(6)
f=(0:N-1)*Fo;            % διάνυσμα συχνοτήτων
Fn=fft(n,N);             % αριθμητικός υπολογισμός του διακριτού μετασχηματισμού
                         % Fourier (DFT) για Ν σημεία      
power_noise= Fn.*conj(Fn)/Fs/L; % Υπολογισμός πυκνότητας φασματικής ισχύος
plot(f,power_noise)            % Ισχύς ανά συνιστώσα συχνότητας 
xlabel('Frequency (Hz)')    
ylabel('Power')
title('{\bf Periodogram of Noise Signal}')% τίτλος διαγράμματος με παχιά γράμματα (\bf)
pause 

% Ισχύς Σήματος Θορύβου
powern_time=sum(abs(n).^2)/L;          % υπολογισμός στο πεδίο του χρόνου
powern_frequency=sum(power_noise)*Fo;  % υπολογισμός στο πεδίο συχνότητας

% σήμα με θόρυβο s στο πεδίο του χρόνου
figure(7)
s=x+n;                    % Προσθέστε το σήμα θορύβου και το x για να λάβετε το σήμα με θόρυβο s
plot(t,s)
title('Time domain plot of s')
xlabel('t(sec)')
ylabel('Amplitude')
axis([0 0.2 -2 2])             % εμφάνιση του σήματος από 0 έως 0.2 sec και
                               % κλίμακα από -2 έως 2
pause
% γραφική παράσταση του αμφίπλευρου φάσματος του s
figure(8)
S=fft(s, N);            % αριθμητικός υπολογισμός DFT για Ν σημεία  
f=(0:N-1)*Fo;           % διάνυσμα συχνοτήτων                 
f=f-Fs/2;               % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
S=fftshift(S);          % ολίσθηση της μηδενικής συχνότητας στο κέντρο 
                        % του φάσματος
plot(f,abs(S));title('Two sided spectrum of s'); xlabel('Frequency (Hz)');
ylabel('Amplitude') 
pause 

disp('Part3')
% Part 3. Πολλαπλασιασμός σημάτων
% Συμπληρώστε τον κώδικα δημιουργίας ενός ημιτονοειδούς σήματος συχνότητας
% 750 Hz και πολλαπλασιάστε με το προηγούμενο σήμα s.
% Τα δύο σήματα θα πρέπει να είναι του ίδιου μεγέθους και να χρησιμοποιηθεί
% ο τελεστής '.*' για ανά στοιχείο πολλαπλασιασμό.
% Σχεδιάστε το αποτέλεσμα στο πεδίο του χρόνου στην περιοχή 0 έως 0.2 sec
% και κλίμακα από -2 έως 2 καθώς και στο πεδίο της συχνότητας
% χρησιμοποιώντας τη συνάρτηση fftshift.

y= sin(2*pi*750*t);    % ημιτονοειδές σήμα συχνότητας 750 Hz        
z= y.* s;              % πολλαπλασιασμος y και s
% σχεδιασμός z στο πεδίο χρόνου 
figure(9)
plot(t,z)
title('Time domain plot of z')
xlabel('t(sec)')
ylabel('Amplitude')
axis([0 0.2 -2 2])             % εμφάνιση του σήματος από 0 έως 0.2 sec και
                               % κλίμακα από -2 έως 2
pause                              
% σχεδιασμός z στο πεδίο συχνότητας
f=(0:N-1)*Fo;           % διάνυσμα συχνοτήτων 
f=f-Fs/2;               % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
Z=fft(z,N);             % αριθμητικός υπολογισμό DFT για Ν σημεία 
Z=fftshift(Z);          % ολίσθηση της μηδενικής συχνότητας στο κέντρο  
                        % του φάσματος

figure(10)
plot(f,abs(Z));
title('Two sided spectrum of z'); xlabel('Frequency (Hz)');
ylabel('Amplitude');  
pause 

